# Erase Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BindingMap..::..Erase Method
BindingMap Class See Also
---
This method is used to erase one item in the map.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public override int Erase(
	Definition key
)
```

Visual Basic
---
```text
Public Overrides Function Erase ( _
	key As Definition _
) As Integer
```

Visual C++
---
```text
public:
virtual int Erase(
	Definition^ key
) override
```

# ### Parameters
key
    Type: Autodesk.Revit.DB..::..Definition
# Remarks
The method Erase inherited from base class is not permitted for this class. A Autodesk::Revit::Exceptions::InvalidOperationException will be thrown. Use Remove() instead to remove the binding from the Revit session and from the map.
# See Also
BindingMap Class
Autodesk.Revit.DB Namespace